zephyrproject-rtos/trusted-firmware-m/platform/ext/target/infineon/pse84/epc2/board/KIT_PSOCE84_EVK/shared/design/default/GeneratedSource/cycfg_system.c
const cy_stc_ppc_attribute_t M33_M55_ppc_1_cfg =
{
    .pcMask = 0xE6,
    .secAttribute = CY_PPC_NON_SECURE,
    .privAttribute = CY_PPC_NONPRIV,
};
const cy_stc_ppc_cfg_t cycfg_ppc_1_domains_config[] =
{
    {
        .regions = &M33S_ppc_1_regions[0],
        .region_count = M33S_ppc_1_REGION_COUNT,
        .cfg = &M33S_ppc_1_cfg,
    },
    {
        .regions = &M33_M55_ppc_1_regions[0],
        .region_count = M33_M55_ppc_1_REGION_COUNT,
        .cfg = &M33_M55_ppc_1_cfg,
    },
};
const size_t cycfg_ppc_1_domains_count = sizeof(cycfg_ppc_1_domains_config) / sizeof(cy_stc_ppc_cfg_t);

#endif //#if (CY_SYSTEM_CPU_M33) && defined(COMPONENT_SECURE_DEVICE) && defined(CY_PDL_TZ_ENABLED)

#if defined(CY_PDL_TZ_ENABLED)
const cy_stc_sau_config_t SAU_config[4] =
{
    {
        .reg_num = 0U,
        .base_addr = 0x00000000,
        .size = 0x10000000,
        .nsc = false,
    },
    {
        .reg_num = 1U,
        .base_addr = 0x20000000,
        .size = 0x10000000,
        .nsc = false,
    },
    {
        .reg_num = 2U,
        .base_addr = 0x40000000,
        .size = 0xc0000000,
        .nsc = false,
    },
    {
        .reg_num = 3,
        .base_addr = NSC_START_ADDRESS,
        .size = NSC_SIZE,
        .nsc = true,
    },
};
#endif /* defined(CY_PDL_TZ_ENABLED) */

#if defined(COMPONENT_SECURE_DEVICE) && defined(COMPONENT_MW_MTB_SRF)
const mtb_srf_protection_range_s_t mxrramc_0_mpc_0_srf_protection_range_s[mxrramc_0_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *) 0x22035000 ,
        .length = 0x2000U,
        .is_secure = true,
    },
    {
        .start = (void *) 0x22037000 ,
        .length = 0x4000U,
        .is_secure = true,
    },
    {
        .start = (void *) 0x2203B000 ,
        .length = 0x1000U,
        .is_secure = true,
    },
};
const mtb_srf_protection_range_s_t mxsramc_0_mpc_0_srf_protection_range_s[mxsramc_0_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *) 0x24001000 ,
        .length = 0x21000U,
        .is_secure = true,
    },
    {
        .start = (void *) 0x24022000 ,
        .length = 0x36000U,
        .is_secure = true,
    },
    {
        .start = (void *) 0x24058000 ,
        .length = 0x28000U,
        .is_secure = false,
    },
};
const mtb_srf_protection_range_s_t mxsramc_1_mpc_0_srf_protection_range_s[mxsramc_1_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *) 0x24080000 ,
        .length = 0x3D000U,
        .is_secure = false,
    },
    {
        .start = (void *) 0x240BD000 ,
        .length = 0x43000U,
        .is_secure = false,
    },
};
const mtb_srf_protection_range_s_t smif_0_mpc_0_srf_protection_range_s[smif_0_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *) 0x60100000 ,
        .length = 0x200000U,
        .is_secure = true,
    },
    {
        .start = (void *) 0x60300000 ,
        .length = 0x40000U,
        .is_secure = true,
    },
    {
        .start = (void *) 0x60340000 ,
        .length = 0x240000U,
        .is_secure = false,
    },
    {
        .start = (void *) 0x60580000 ,
        .length = 0x300000U,
        .is_secure = false,
    },
    {
        .start = (void *) 0x60100000,
        .length = 0x200000U,
        .is_secure = true,
    },
    {
        .start = (void *) 0x60300000,
        .length = 0x40000U,
        .is_secure = true,
    },
    {
        .start = (void *) 0x60340000,
        .length = 0x240000U,
        .is_secure = false,
    },
    {
        .start = (void *) 0x60580000,
        .length = 0x300000U,
        .is_secure = false,
    },
};
const mtb_srf_protection_range_s_t socmem_0_mpc_0_srf_protection_range_s[socmem_0_mpc_0_REGION_COUNT] =
{
    {
        .start = (void *) 0x26000000 ,
        .length = 0x2FE000U,
        .is_secure = false,
    },
    {
        .start = (void *) 0x262FE000 ,
        .length = 0x202000U,
        .is_secure = false,
    },
};
#endif /* defined(COMPONENT_SECURE_DEVICE) && defined(COMPONENT_MW_MTB_SRF) */

#if defined(CY_PDL_TZ_ENABLED)
cy_rslt_t _cycfg_mpc_init_regions_rram(const cy_stc_mpc_regions_t* region, const cy_stc_mpc_rot_cfg_t* cfg, uint8_t cfg_count);
cy_rslt_t _cycfg_mpc_init_regions(const cy_stc_mpc_regions_t* region, const cy_stc_mpc_rot_cfg_t* config, uint8_t cfg_count);
#endif /* defined(CY_PDL_TZ_ENABLED) */

void init_cycfg_ns_power(void)
{
    /* Update global variables used by DeepSleep functions */
    #if (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP)
        Cy_SysPm_DeepSleepSetup(CY_SYSPM_MODE_DEEPSLEEP);
    #elif (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_RAM)
        Cy_SysPm_DeepSleepSetup(CY_SYSPM_MODE_DEEPSLEEP_RAM);
    #elif (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_OFF)
        Cy_SysPm_DeepSleepSetup(CY_SYSPM_MODE_DEEPSLEEP_OFF);
    #endif /* CY_CFG_PWR_SYS_IDLE_MODE */
    
}
void init_cycfg_power(void)
{
       Cy_SysPm_Init();
    
       /* **System Active Power Mode Profile Configuration** */
       #if (CY_CFG_PWR_SYS_ACTIVE_PROFILE == CY_CFG_PWR_MODE_HP)
           Cy_SysPm_SystemEnterHp();
       #elif (CY_CFG_PWR_SYS_ACTIVE_PROFILE == CY_CFG_PWR_MODE_ULP)
           Cy_SysPm_SystemEnterUlp();
       #elif (CY_CFG_PWR_SYS_ACTIVE_PROFILE == CY_CFG_PWR_MODE_LP)
           Cy_SysPm_SystemEnterLp();
       #endif /* CY_CFG_PWR_SYS_IDLE_MODE */
    
       /* **System Domain Idle Power Mode Configuration** */
       #if (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP)
           Cy_SysPm_SetDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP);
           Cy_SysPm_SetAppDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP);
       #elif (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_RAM)
           Cy_SysPm_SetDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP_RAM);
           Cy_SysPm_SetAppDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP_RAM);
       #elif (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_OFF)
           Cy_SysPm_SetDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP_OFF);
           Cy_SysPm_SetAppDeepSleepMode(CY_SYSPM_MODE_DEEPSLEEP_OFF);
       #endif /* CY_CFG_PWR_SYS_IDLE_MODE */
    
       Cy_SysPm_DeepSleepUpdate();
    
       /* **Power domains Configuration** */
       #if (CY_CFG_PWR_PD1_DOMAIN)
           #if defined(CORE_NAME_CM33_0) && defined(CY_PDL_TZ_ENABLED)
               /* Enables PD1 power domain */
               Cy_System_EnablePD1();
               /* Enables APP_MMIO_TCM memory for CM55 core */
               Cy_SysClk_PeriGroupSlaveInit(CY_MMIO_CM55_TCM_512K_PERI_NR, CY_MMIO_CM55_TCM_512K_GROUP_NR, \
                                     CY_MMIO_CM55_TCM_512K_SLAVE_NR, CY_MMIO_CM55_TCM_512K_CLK_HF_NR);
    
               /* Clear SYSCPU and APPCPU power domain dependency set by boot code */
               cy_pd_pdcm_clear_dependency(CY_PD_PDCM_APPCPU, CY_PD_PDCM_SYSCPU);
    
           #endif /* defined(CORE_NAME_CM33_0) && defined(CY_PDL_TZ_ENABLED) */
       #endif /* (CY_CFG_PWR_PD1_DOMAIN) */
}

