zephyrproject-rtos/trusted-firmware-m/platform/ext/target/infineon/pse84/epc2/board/KIT_PSOCE84_EVK/shared/design/default/GeneratedSource/cycfg_system.c
    #if (smif_0_mpc_0_REGION_COUNT > 0U)
        if(isSmif0Uninitialized) 
        {
            /* Disable IP as MPC configuration is complete*/
            Cy_SMIF_Disable(SMIF0_CORE);
        }
    #endif // (smif_0_mpc_0_REGION_COUNT > 0U)
    
        return retResult;
}
#endif /* defined(CY_PDL_TZ_ENABLED) */

#if (CY_SYSTEM_CPU_M33) && defined(COMPONENT_SECURE_DEVICE) && defined(CY_PDL_TZ_ENABLED)
cy_rslt_t Cy_PPC_Init(PPC_Type* base, const cy_stc_ppc_cfg_t cfg[], uint32_t count, cy_en_ppc_resp_cfg_t response)
{
    cy_rslt_t ret = Cy_Ppc_InitPpc(base, response);
    
    for (size_t domain_idx = 0; ret == CY_PPC_SUCCESS && domain_idx < count; domain_idx++)
    {
        const cy_stc_ppc_cfg_t* ppc_config = &cfg[domain_idx];
        const cy_en_prot_region_t* regions = ppc_config->regions;
        const cy_stc_ppc_attribute_t* attributes = ppc_config->cfg;
        for (size_t region_idx = 0; region_idx < ppc_config->region_count; region_idx++)
        {
            ret = Cy_Ppc_ConfigAttrib(base, regions[region_idx], attributes);
            if (ret == CY_RSLT_SUCCESS)
                ret = Cy_Ppc_SetPcMask(base, regions[region_idx], attributes->pcMask);
        }
    }
    return ret;
}
cy_rslt_t init_cycfg_ppc0(void)
{
    return Cy_PPC_Init(PPC0, cycfg_ppc_0_domains_config, cycfg_ppc_0_domains_count, CY_PPC_BUS_ERR);
}
cy_rslt_t init_cycfg_ppc1(void)
{
    return Cy_PPC_Init(PPC1, cycfg_ppc_1_domains_config, cycfg_ppc_1_domains_count, CY_PPC_BUS_ERR);
}
#endif /* (CY_SYSTEM_CPU_M33) && defined(COMPONENT_SECURE_DEVICE) && defined(CY_PDL_TZ_ENABLED) */

void init_cycfg_system(void)
{
#if defined (CY_CFG_PWR_ENABLED) && defined (CY_CFG_PWR_INIT)
    init_cycfg_power();
#endif /* defined (CY_CFG_PWR_ENABLED) && defined (CY_CFG_PWR_INIT) */
}
